index=wineventlog source="WinEventLog:Security" (EventCode=4624 OR EventCode=4625)
| eval LogonHour=strftime(_time, "%H")
| where LogonHour < 7 OR LogonHour >= 19
| table _time, EventCode, Account_Name, LogonType, LogonHour, Workstation_Name, ComputerName
| sort -_time
